Ac6Embedded/svd-microchip/PIC32CK_SG/PIC32CK1012SG01048.svd
               <register>
                  <dim>32</dim>
                  <dimIncrement>1</dimIncrement>
                  <name>PINCFG[%s]</name>
                  <description>Pin Configuration</description>
                  <addressOffset>0x40</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>PMUXEN</name>
                        <description>Peripheral Multiplexer Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INEN</name>
                        <description>Input Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PULLEN</name>
                        <description>Pull Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ODRAIN</name>
                        <description>Open Drain Output</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SLEWLIM</name>
                        <description>Output Driver Slew Rate Selection</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SLEWLIMSelect</name>
                           <enumeratedValue>
                              <name>FAST</name>
                              <description>Slew rate control disabled (fast rise/fall time operation)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SLOW4</name>
                              <description>Slew rate control enabled (4x slower)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SLOW8</name>
                              <description>Slew rate control enabled (8x slower)</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SLOW12</name>
                              <description>Slew rate control enabled (12x slower)</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENCLR</name>
                  <description>Interrupt Enable Clear</description>
                  <addressOffset>0x60</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>NSCHK</name>
                        <description>Non-Secure Check Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENSET</name>
                  <description>Interrupt Enable Set</description>
                  <addressOffset>0x64</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>NSCHK</name>
                        <description>Non-Secure Check Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTFLAG</name>
                  <description>Interrupt Flag Status and Clear</description>
                  <addressOffset>0x68</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>NSCHK</name>
                        <description>Non-Secure Check</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>NONSEC</name>
                  <description>Security Attribution</description>
                  <addressOffset>0x6C</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>NONSEC</name>
                        <description>Port Security Attribution</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>NSCHK</name>
                  <description>Security Attribution Check</description>
                  <addressOffset>0x70</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>NSCHK</name>
                        <description>Port Security Attribution Check</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
