Ac6Embedded/svd-microchip/PIC32CK_SG/PIC32CK1012SG01048.svd
               <register>
                  <name>ADDR</name>
                  <description>SPIM Address</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>Address Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>ADDRMASK</name>
                        <description>Address Mask</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DATA</name>
                  <description>SPIM Data</description>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DATA</name>
                        <description>Data Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DBGCTRL</name>
                  <description>SPIM Debug Control</description>
                  <addressOffset>0x30</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DBGSTOP</name>
                        <description>Debug Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FIFOSPACE</name>
                  <description>SPIM FIFO Space</description>
                  <addressOffset>0x34</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>TXSPACE</name>
                        <description>Tx FIFO Empty Space</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>RXSPACE</name>
                        <description>Rx FIFO Filled Space</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FIFOPTR</name>
                  <description>SPIM FIFO CPU Pointers</description>
                  <addressOffset>0x36</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>CPUWRPTR</name>
                        <description>CPU FIFO Write Pointer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>CPURDPTR</name>
                        <description>CPU FIFO Read Pointer</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <name>USART_INT</name>
               <description>USART INTERNAL CLOCK Mode</description>
               <alternateCluster>I2CM</alternateCluster>
               <headerStructName>SercomUsart_int</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>USART Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>USART_EXT_CLK</name>
                              <description>USART with external clock</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART_INT_CLK</name>
                              <description>USART with internal clock</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_SLAVE</name>
                              <description>SPI in slave operation</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_MASTER</name>
                              <description>SPI in master operation</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2C_SLAVE</name>
                              <description>I2C slave operation</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2C_MASTER</name>
                              <description>I2C master operation</description>
                              <value>0x5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run during Standby</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IBON</name>
                        <description>Immediate Buffer Overflow Notification</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXINV</name>
                        <description>Transmit Data Invert</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>TXINVSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>TxD is not inverted</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>INV</name>
                              <description>TxD is inverted</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RXINV</name>
                        <description>Receive Data Invert</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>RXINVSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>RxD is not inverted</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>INV</name>
                              <description>RxD is inverted</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SAMPR</name>
                        <description>Sample</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>SAMPRSelect</name>
                           <enumeratedValue>
                              <name>ARITHM16X</name>
                              <description>16x oversampling using arithmetic baud rate generation</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FRAC16X</name>
                              <description>16x oversampling using fractional baud rate generation</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ARITHM8X</name>
                              <description>8x oversampling using arithmetic baud rate generation</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FRAC8X</name>
                              <description>8x oversampling using fractional baud rate generation</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ARITHM3X</name>
                              <description>3x oversampling using arithmetic baud rate generation</description>
                              <value>0x4</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TXPO</name>
                        <description>Transmit Data Pinout</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>TXPOSelect</name>
                           <enumeratedValue>
                              <name>PAD0</name>
                              <description>PAD[0] = TxD; PAD[1] = XCK</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PAD2</name>
                              <description>PAD[0] = TxD; PAD[2] = RTS; PAD[3] = CTS</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PAD3</name>
                              <description>PAD[0] = TxD; PAD[1] = XCK; PAD[2] = TE</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RXPO</name>
                        <description>Receive Data Pinout</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>RXPOSelect</name>
                           <enumeratedValue>
                              <name>PAD0</name>
                              <description>SERCOM PAD0 is used for data reception</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PAD1</name>
                              <description>SERCOM PAD1 is used for data reception</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PAD2</name>
                              <description>SERCOM PAD2 is used for data reception</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PAD3</name>
                              <description>SERCOM PAD3 is used for data reception</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SAMPA</name>
                        <description>Sample Adjustment</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>FORM</name>
                        <description>Frame Format</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>FORMSelect</name>
                           <enumeratedValue>
                              <name>USART</name>
                              <description>USART frame</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USARTP</name>
                              <description>USART frame with parity</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LINBRKGEN</name>
                              <description>LIN Master Break and Synck generation</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LINBRKDET</name>
                              <description>LIN Slave break detection and auto-baud</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BRKDET</name>
                              <description>Break detection and auto-baud with parity</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ISO7816</name>
                              <description>ISO 7816 Communication</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CMODE</name>
                        <description>Communication Mode</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>CMODESelect</name>
                           <enumeratedValue>
                              <name>ASYNC</name>
                              <description>Asynchronous communication.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SYNC</name>
                              <description>Synchronous communication.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CPOL</name>
                        <description>Clock Polarity</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DORD</name>
                        <description>Data Order</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>DORDSelect</name>
                           <enumeratedValue>
                              <name>MSB</name>
                              <description>MSB is transmitted first.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LSB</name>
                              <description>LSB is transmitted first.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
